src/test/resources/requests/Update_Ticket_EM.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>em</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">em=123</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:updateTicketRequest xmlns:ns0="http://aots.att.com/ticket/v1">
            <ns1:WSHeader xmlns:ns1="http://cio.att.com/commonheader/v3">
                <ns1:WSContext>
                    <ns1:FromAppId>EM</ns1:FromAppId>
                    <ns1:SourceIPAddress>aotswjl.test.att.com</ns1:SourceIPAddress>
                </ns1:WSContext>
            </ns1:WSHeader>
            <ns0:updateTicketInput>
                <ns2:Log xmlns:ns2="http://tktsvc.aots.att.com/ticket">E MAINTAINANCE CUSTOMER STATES: 

Time Zone: EST

Notification Types: IVR

Calendar Preference: defaultCal_24x7_Mon-Sun_ivr

</ns2:Log>
                <ns3:LogUserID xmlns:ns3="http://tktsvc.aots.att.com/ticket">EM</ns3:LogUserID>
                <ns4:LogUserName xmlns:ns4="http://tktsvc.aots.att.com/ticket">E-Maintainance</ns4:LogUserName>
                <ns5:SecondaryActivityTypeCode xmlns:ns5="http://tktsvc.aots.att.com/ticket">99</ns5:SecondaryActivityTypeCode>
                <ns6:NextCheckTime xmlns:ns6="http://tktsvc.aots.att.com/ticket">1636394314</ns6:NextCheckTime>
                <ns7:ReferralAction xmlns:ns7="http://tktsvc.aots.att.com/ticket">CustomerMessage</ns7:ReferralAction>
                <ns8:UserID xmlns:ns8="http://tktsvc.aots.att.com/ticket">EM</ns8:UserID>
            </ns0:updateTicketInput>
            <ns0:updateControlInput>
                <ns9:FunctionalArea xmlns:ns9="http://tktsvc.aots.att.com/ticket">SD_HOSTING</ns9:FunctionalArea>
                <ns10:TicketNum xmlns:ns10="http://tktsvc.aots.att.com/ticket">CS0012139</ns10:TicketNum>
                <ns11:LockForUpdate xmlns:ns11="http://tktsvc.aots.att.com/ticket">false</ns11:LockForUpdate>
            </ns0:updateControlInput>
        </ns0:updateTicketRequest>
    </soap-env:Body>
</soap-env:Envelope>